import com.alibaba.fastjson.JSONArray;
import com.alibaba.fastjson.JSONObject;
import com.example.swaredemo1.Dao.dao;
import org.springframework.beans.factory.annotation.Autowired;

public class test {




//    public static void main(String[] args) {
//        String str1 = "{\n" +
//                "  \"result\": {\n" +
//                "    \"college\": \"武汉理工大学\",\n" +
//                "    \"cont_award\": \"普通话一级甲等\\n通过全国计算机二级考试,熟练运用office相关软件。\\n熟练使用绘声绘色软件,剪辑过各种类型的电影及班级视频。\\n大学英语四/六级(CET-4/6),良好听说读写能力,快速浏览英语专业书籍。\\n奖项荣誉\\n2011年  新长城武汉理工大学自强社\\u201c优秀社员\\u201d\\n2010年  三下乡\\u201d社会实践活动\\u201c优秀学生\\u201d\\n2009年  武汉理工大学学生田径运动会10人立定跳远团体赛第三名\\n2008年  学生军事技能训练\\u201c优秀学员\\u201d\\n2007年  武汉理工大学盼盼杯烘焙食品创意大赛优秀奖\\n2006年  西部高校大学生主题征文一等奖\\n2005年  武汉理工大学\\u201c点燃川大梦  畅享我青春\\u201d微博文征集大赛二等奖\",\n" +
//                "    \"resume_parse_time\": \"2023-05-10 20:03:37\",\n" +
//                "    \"cont_job_exp\": \"2015.12-至今                          迅维控股集团                     副总监\\n· 负责协助集团旗下事业部开展各项工作,制定品牌传播方案;\\n· 结合集团与事业部发展,制定营销策略、广告策略、品牌策略和公关策略,并组织推进执行;\\n· 制定和执行媒体投放计划,跟踪和监督媒体投放效果,进行数据分析与撰写报告;\\n· 研究行业发展动态,定期进行市场调查,为产品更新提供建议。\\n2013.12-2015.12                      立翔有限公司                      市场及运营总监\\n· 根据公司发展情况进行战略调整,配合前端销售部门搭建销售渠道;\\n· 研究行业发展动态,定期进行市场调查,为产品更新提供建议;\\n· 负责公司部门(营运、品牌策划)制度规范,负责组织及监管市场部关于对外合作、推广策划以相关工作的落实。\\n2011.12-2013.12                       杉永俱乐部                        市场副总监\\n· 负责事业部产品对外推广和宣传,制定各种整合营销的活动;\\n· 执行媒体投放计划,跟踪和监督媒体投放效果,进行数据分析撰写报告;\\n· 向市场总监提供营销支持,并协助相关的公关事宜。\",\n" +
//                "    \"training_objs\": [],\n" +
//                "    \"resume_type\": \"0\",\n" +
//                "    \"job_exp_objs\": [\n" +
//                "      {\n" +
//                "        \"end_date\": \"至今\",\n" +
//                "        \"job_pos_type_p\": \"公关总监\",\n" +
//                "        \"job_content\": \"负责协助集团旗下事业部开展各项工作,制定品牌传播方案;\\n· 结合集团与事业部发展,制定营销策略、广告策略、品牌策略和公关策略,并组织推进执行;\\n· 制定和执行媒体投放计划,跟踪和监督媒体投放效果,进行数据分析与撰写报告;\\n· 研究行业发展动态,定期进行市场调查,为产品更新提供建议。\",\n" +
//                "        \"job_position\": \"副总监\",\n" +
//                "        \"job_duration\": \"7年5个月\",\n" +
//                "        \"job_cpy\": \"迅维控股集团\",\n" +
//                "        \"start_date\": \"2015.12\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"end_date\": \"2015.12\",\n" +
//                "        \"job_pos_type_p\": \"市场/营销/拓展总监\",\n" +
//                "        \"job_content\": \"根据公司发展情况进行战略调整,配合前端销售部门搭建销售渠道;\\n· 研究行业发展动态,定期进行市场调查,为产品更新提供建议;\\n· 负责公司部门(营运、品牌策划)制度规范,负责组织及监管市场部关于对外合作、推广策划以相关工作的落实。\",\n" +
//                "        \"job_position\": \"市场及运营总监\",\n" +
//                "        \"job_duration\": \"2年\",\n" +
//                "        \"job_cpy\": \"立翔有限公司\",\n" +
//                "        \"start_date\": \"2013.12\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"end_date\": \"2013.12\",\n" +
//                "        \"job_pos_type_p\": \"市场/营销/拓展总监\",\n" +
//                "        \"job_dept\": \"俱乐部\",\n" +
//                "        \"job_content\": \"负责事业部产品对外推广和宣传,制定各种整合营销的活动;\\n· 执行媒体投放计划,跟踪和监督媒体投放效果,进行数据分析撰写报告;\\n· 向市场总监提供营销支持,并协助相关的公关事宜。\",\n" +
//                "        \"job_position\": \"市场副总监\",\n" +
//                "        \"job_duration\": \"2年\",\n" +
//                "        \"job_cpy\": \"杉永\",\n" +
//                "        \"start_date\": \"2011.12\"\n" +
//                "      }\n" +
//                "    ],\n" +
//                "    \"social_exp_objs\": [],\n" +
//                "    \"work_company\": \"迅维控股集团\",\n" +
//                "    \"major\": \"市场营销\",\n" +
//                "    \"computer_level\": \"计算机二级\",\n" +
//                "    \"proj_exp_objs\": [\n" +
//                "      {\n" +
//                "        \"proj_content\": \"杉永集团品牌升级发布会\\n· 集团全新品牌logo及VI上线,在多渠道进行了传播;\\n· 企业VIP客户群体逾60人,结合了线上发布、线下体验;\\n· 后续媒体报道持续升温,子品牌结合明星代言人制造话题营销,为期3周。\\n立翔商业模式发布会\\n· 整场活动以会议+洽谈双重模式进行,首日以介绍立翔内部平台资源优势,一对多推介会进行推广普及;\\n· 现场签署地方合作意向书,如:新疆、江西、浙江等优秀企业商户;\\n· 以中国的波尔多为宣传点,主推旗下新疆大型项目,制造营销、品牌热点。\\n迅维投资控股集团6A自媒体生态圈建设\\n· 本项目重构了公司现有微信企业号的功能与架构。\\n· 提高公众号的关注粉丝量的同时,对于有客户进行统一宣传,统一管理。\",\n" +
//                "        \"proj_name\": \"杉永集团品牌升级发布会\"\n" +
//                "      }\n" +
//                "    ],\n" +
//                "    \"surname\": \"吕\",\n" +
//                "    \"work_year_inf\": \"11.5\",\n" +
//                "    \"college_type\": \"2\",\n" +
//                "    \"resume_name\": \"cv20230510_200337003_370.docx\",\n" +
//                "    \"lang_objs\": [],\n" +
//                "    \"work_start_time_inf\": \"2011.12\",\n" +
//                "    \"email\": \"nesson@91muban.cn\",\n" +
//                "    \"cont_my_desc\": \"拥有多年的市场管理及品牌营销经验,卓越的规划、组织、策划、方案执行和团队领导能力,积累较强的人际关系处理能力和商务谈判技巧,善于沟通,具备良好的合作关系掌控能力与市场开拓能力;\\n敏感的商业和市场意识,具备优秀的资源整合能力、业务推进能力;\\n思维敏捷,有培训演讲能力,懂激励艺术,能带动团队的积极性;擅长协调平衡团队成员的竞争与合作的关系,善于通过培训提高团队综合能力和凝聚力。\",\n" +
//                "    \"raw_text\": \"1986.04.04\\n+86 13800138000\\nnesson@91muban.cn\\n吕致盈\\n求职目标:市场总监-专注品牌\\n教育背景\\n2008.07-2011.06                       武汉理工大学                      市场营销(硕士)\\n主修课程:管理学、微观经济学、宏观经济学、管理信息系统、统计学、会计学、财务管理、市场营销、经济法、消费者行为学、国际市场营销。\\n2004.07-2008.06                       武汉理工大学                     市场营销(本科)\\n主修课程:管理学、微观经济学、宏观经济学、管理信息系统、统计学、会计学、财务管理、市场营销、经济法、消费者行为学、国际市场营销。\\n工作经历\\n2015.12-至今                          迅维控股集团                     副总监\\n· 负责协助集团旗下事业部开展各项工作,制定品牌传播方案;\\n· 结合集团与事业部发展,制定营销策略、广告策略、品牌策略和公关策略,并组织推进执行;\\n· 制定和执行媒体投放计划,跟踪和监督媒体投放效果,进行数据分析与撰写报告;\\n· 研究行业发展动态,定期进行市场调查,为产品更新提供建议。\\n2013.12-2015.12                      立翔有限公司                      市场及运营总监\\n· 根据公司发展情况进行战略调整,配合前端销售部门搭建销售渠道;\\n· 研究行业发展动态,定期进行市场调查,为产品更新提供建议;\\n· 负责公司部门(营运、品牌策划)制度规范,负责组织及监管市场部关于对外合作、推广策划以相关工作的落实。\\n2011.12-2013.12                       杉永俱乐部                        市场副总监\\n· 负责事业部产品对外推广和宣传,制定各种整合营销的活动;\\n· 执行媒体投放计划,跟踪和监督媒体投放效果,进行数据分析撰写报告;\\n· 向市场总监提供营销支持,并协助相关的公关事宜。\\n校园实践\\n2005.05-2008.06                       武汉理工大学                      辩论队(队长)\\n· 负责50余人团队的日常训练、选拔及团队建设;\\n· 作为负责人对接多项商业校园行活动,如《奔跑吧兄弟》大学站录制、《时代周末》校园行。\\n2008.11-2010.06                       沟通与交流协会                      创始人/副会长\\n· 协助湖北省沟通协会创立武汉理工大学分部,从零开始组建初期团队;\\n· 策划协会会员制,选拔、培训协会导师,推出一系列沟通课程。\\n项目经历\\n杉永集团品牌升级发布会\\n· 集团全新品牌logo及VI上线,在多渠道进行了传播;\\n· 企业VIP客户群体逾60人,结合了线上发布、线下体验;\\n· 后续媒体报道持续升温,子品牌结合明星代言人制造话题营销,为期3周。\\n立翔商业模式发布会\\n· 整场活动以会议+洽谈双重模式进行,首日以介绍立翔内部平台资源优势,一对多推介会进行推广普及;\\n· 现场签署地方合作意向书,如:新疆、江西、浙江等优秀企业商户;\\n· 以中国的波尔多为宣传点,主推旗下新疆大型项目,制造营销、品牌热点。\\n迅维投资控股集团6A自媒体生态圈建设\\n· 本项目重构了公司现有微信企业号的功能与架构。\\n· 提高公众号的关注粉丝量的同时,对于有客户进行统一宣传,统一管理。\\n兴趣爱好\\n阅读 / 旅行 / 跑步 / 羽毛球 / 爬山 / 烹饪\\n自我评价\\n拥有多年的市场管理及品牌营销经验,卓越的规划、组织、策划、方案执行和团队领导能力,积累较强的人际关系处理能力和商务谈判技巧,善于沟通,具备良好的合作关系掌控能力与市场开拓能力;\\n敏感的商业和市场意识,具备优秀的资源整合能力、业务推进能力;\\n思维敏捷,有培训演讲能力,懂激励艺术,能带动团队的积极性;擅长协调平衡团队成员的竞争与合作的关系,善于通过培训提高团队综合能力和凝聚力。\\n奖项荣誉\\n普通话一级甲等\\n通过全国计算机二级考试,熟练运用office相关软件。\\n熟练使用绘声绘色软件,剪辑过各种类型的电影及班级视频。\\n大学英语四/六级(CET-4/6),良好听说读写能力,快速浏览英语专业书籍。\\n奖项荣誉\\n2011年  新长城武汉理工大学自强社\\u201c优秀社员\\u201d\\n2010年  三下乡\\u201d社会实践活动\\u201c优秀学生\\u201d\\n2009年  武汉理工大学学生田径运动会10人立定跳远团体赛第三名\\n2008年  学生军事技能训练\\u201c优秀学员\\u201d\\n2007年  武汉理工大学盼盼杯烘焙食品创意大赛优秀奖\\n2006年  西部高校大学生主题征文一等奖\\n2005年  武汉理工大学\\u201c点燃川大梦  畅享我青春\\u201d微博文征集大赛二等奖\",\n" +
//                "    \"cert_objs\": [],\n" +
//                "    \"work_start_time\": \"2011.12\",\n" +
//                "    \"cont_basic_info\": \"1986.04.04\\n+86 13800138000\\nnesson@91muban.cn\\n吕致盈\\n求职目标:市场总监-专注品牌\",\n" +
//                "    \"work_position\": \"副总监\",\n" +
//                "    \"degree\": \"硕士\",\n" +
//                "    \"work_year\": \"11.5\",\n" +
//                "    \"education_objs\": [\n" +
//                "      {\n" +
//                "        \"end_date\": \"2011.06\",\n" +
//                "        \"edu_college_type\": \"2\",\n" +
//                "        \"edu_college\": \"武汉理工大学\",\n" +
//                "        \"edu_degree\": \"硕士\",\n" +
//                "        \"edu_content\": \"主修课程:管理学、微观经济学、宏观经济学、管理信息系统、统计学、会计学、财务管理、市场营销、经济法、消费者行为学、国际市场营销。\",\n" +
//                "        \"edu_major\": \"市场营销\",\n" +
//                "        \"edu_college_rank\": \"51\",\n" +
//                "        \"edu_degree_norm\": \"硕士研究生\",\n" +
//                "        \"start_date\": \"2008.07\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"end_date\": \"2008.06\",\n" +
//                "        \"edu_college_type\": \"2\",\n" +
//                "        \"edu_college\": \"武汉理工大学\",\n" +
//                "        \"edu_degree\": \"本科\",\n" +
//                "        \"edu_content\": \"主修课程:管理学、微观经济学、宏观经济学、管理信息系统、统计学、会计学、财务管理、市场营销、经济法、消费者行为学、国际市场营销。\",\n" +
//                "        \"edu_major\": \"市场营销\",\n" +
//                "        \"edu_college_rank\": \"51\",\n" +
//                "        \"edu_degree_norm\": \"本科\",\n" +
//                "        \"start_date\": \"2004.07\"\n" +
//                "      }\n" +
//                "    ],\n" +
//                "    \"cont_education\": \"2008.07-2011.06                       武汉理工大学                      市场营销(硕士)\\n主修课程:管理学、微观经济学、宏观经济学、管理信息系统、统计学、会计学、财务管理、市场营销、经济法、消费者行为学、国际市场营销。\\n2004.07-2008.06                       武汉理工大学                     市场营销(本科)\\n主修课程:管理学、微观经济学、宏观经济学、管理信息系统、统计学、会计学、财务管理、市场营销、经济法、消费者行为学、国际市场营销。\",\n" +
//                "    \"college_rank\": \"51\",\n" +
//                "    \"work_year_norm\": \"11.5\",\n" +
//                "    \"cont_campus_exp\": \"2005.05-2008.06                       武汉理工大学                      辩论队(队长)\\n· 负责50余人团队的日常训练、选拔及团队建设;\\n· 作为负责人对接多项商业校园行活动,如《奔跑吧兄弟》大学站录制、《时代周末》校园行。\\n2008.11-2010.06                       沟通与交流协会                      创始人/副会长\\n· 协助湖北省沟通协会创立武汉理工大学分部,从零开始组建初期团队;\\n· 策划协会会员制,选拔、培训协会导师,推出一系列沟通课程。\",\n" +
//                "    \"work_pos_type_p\": \"公关总监\",\n" +
//                "    \"all_cert_objs\": [\n" +
//                "      {\n" +
//                "        \"cert_name\": \"普通话一级甲等\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"cert_name\": \"全国计算机二级考试\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"cert_name\": \"大学英语4级\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"cert_name\": \"优秀社员\"\n" +
//                "      }\n" +
//                "    ],\n" +
//                "    \"cont_proj_exp\": \"杉永集团品牌升级发布会\\n· 集团全新品牌logo及VI上线,在多渠道进行了传播;\\n· 企业VIP客户群体逾60人,结合了线上发布、线下体验;\\n· 后续媒体报道持续升温,子品牌结合明星代言人制造话题营销,为期3周。\\n立翔商业模式发布会\\n· 整场活动以会议+洽谈双重模式进行,首日以介绍立翔内部平台资源优势,一对多推介会进行推广普及;\\n· 现场签署地方合作意向书,如:新疆、江西、浙江等优秀企业商户;\\n· 以中国的波尔多为宣传点,主推旗下新疆大型项目,制造营销、品牌热点。\\n迅维投资控股集团6A自媒体生态圈建设\\n· 本项目重构了公司现有微信企业号的功能与架构。\\n· 提高公众号的关注粉丝量的同时,对于有客户进行统一宣传,统一管理。\",\n" +
//                "    \"expect_job\": \"市场总监\",\n" +
//                "    \"resume_integrity\": \"63\",\n" +
//                "    \"skills_objs\": [\n" +
//                "      {\n" +
//                "        \"skills_name\": \"策划\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"skills_name\": \"商务谈判\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"skills_name\": \"演讲\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"skills_name\": \"公关\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"skills_name\": \"数据分析\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"skills_name\": \"前端\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"skills_name\": \"品牌策划\"\n" +
//                "      }\n" +
//                "    ],\n" +
//                "    \"phone\": \"13800138000\",\n" +
//                "    \"cont_hobby\": \"阅读 / 旅行 / 跑步 / 羽毛球 / 爬山 / 烹饪\",\n" +
//                "    \"name\": \"吕致盈\",\n" +
//                "    \"grad_time\": \"2011.06\"\n" +
//                "  },\n" +
//                "  \"eval\": {\n" +
//                "    \"salary\": 24600\n" +
//                "  },\n" +
//                "  \"status\": {\n" +
//                "    \"code\": 200,\n" +
//                "    \"message\": \"success\"\n" +
//                "  },\n" +
//                "  \"tags\": {\n" +
//                "    \"pos_tags\": [\n" +
//                "      {\n" +
//                "        \"tag_weight\": 1.4261093220114707,\n" +
//                "        \"tag_name\": \"市场总监\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"tag_weight\": 1,\n" +
//                "        \"tag_name\": \"总监\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"tag_weight\": 0.6580936082601547,\n" +
//                "        \"tag_name\": \"运营总监\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"tag_weight\": 0.47632285451889034,\n" +
//                "        \"tag_name\": \"市场经理\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"tag_weight\": 0.45715227413177484,\n" +
//                "        \"tag_name\": \"销售总监\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"tag_weight\": 0.45287167096138,\n" +
//                "        \"tag_name\": \"品牌总监\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"tag_weight\": 0.44858748221397393,\n" +
//                "        \"tag_name\": \"运营经理\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"tag_weight\": 0.43943255513906476,\n" +
//                "        \"tag_name\": \"运营官\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"tag_weight\": 0.43931889295578,\n" +
//                "        \"tag_name\": \"市场推广经理\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"tag_weight\": 0.4307805685400962,\n" +
//                "        \"tag_name\": \"产品运营总监\"\n" +
//                "      }\n" +
//                "    ],\n" +
//                "    \"industries\": [],\n" +
//                "    \"skills_tags\": [\n" +
//                "      {\n" +
//                "        \"tag_weight\": 0.7286976957321167,\n" +
//                "        \"tag_name\": \"营销\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"tag_weight\": 0.5002113056182862,\n" +
//                "        \"tag_name\": \"市场调查\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"tag_weight\": 0.47451878786087043,\n" +
//                "        \"tag_name\": \"媒体投放\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"tag_weight\": 0.3821192264556885,\n" +
//                "        \"tag_name\": \"品牌传播\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"tag_weight\": 0.3777706289291382,\n" +
//                "        \"tag_name\": \"自媒体\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"tag_weight\": 0.3507879972457886,\n" +
//                "        \"tag_name\": \"广告策略\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"tag_weight\": 0.34464378356933595,\n" +
//                "        \"tag_name\": \"品牌策略\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"tag_weight\": 0.1546603512763977,\n" +
//                "        \"tag_name\": \"推广策划\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"tag_weight\": 0.15219221830368043,\n" +
//                "        \"tag_name\": \"市场\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"tag_weight\": 0.1430668544769287,\n" +
//                "        \"tag_name\": \"销售渠道\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"tag_weight\": 0.14075592279434204,\n" +
//                "        \"tag_name\": \"品牌策划\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"tag_weight\": 0.1327861261367798,\n" +
//                "        \"tag_name\": \"对外合作\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"tag_weight\": 0.11650890111923218,\n" +
//                "        \"tag_name\": \"市场总监\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"tag_weight\": 0.08238505125045777,\n" +
//                "        \"tag_name\": \"营销支持\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"tag_weight\": 0.08097717761993409,\n" +
//                "        \"tag_name\": \"外推\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"tag_weight\": 0.07868234515190126,\n" +
//                "        \"tag_name\": \"整合营销\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"tag_weight\": 0.06663917899131776,\n" +
//                "        \"tag_name\": \"数据分析\"\n" +
//                "      }\n" +
//                "    ],\n" +
//                "    \"pos_types\": [\n" +
//                "      {\n" +
//                "        \"tag_weight\": 1.0534486326825119,\n" +
//                "        \"tag_name\": \"销售总监\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"tag_weight\": 0.8998448572243651,\n" +
//                "        \"tag_name\": \"市场/营销/拓展总监\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"tag_weight\": 0.5086756506454155,\n" +
//                "        \"tag_name\": \"市场/营销/拓展经理\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"tag_weight\": 0.3837369964697483,\n" +
//                "        \"tag_name\": \"总监/部门经理\"\n" +
//                "      },\n" +
//                "      {\n" +
//                "        \"tag_weight\": 0.32990421329344344,\n" +
//                "        \"tag_name\": \"网站营运总监\"\n" +
//                "      }\n" +
//                "    ]\n" +
//                "  }\n" +
//                "}";
//        JSONObject jsonObject = JSONObject.parseObject(str1);
//        System.out.println(jsonObject.getJSONObject("result").get("name"));
////        JSONArray jsonArray = jsonObject.getJSONArray("result");
//    }

}
