<template>
  <div>
  <div ref="chart123" style="width: auto; height: 500px;overflow: auto"></div>
  <el-button @click="pre">pre</el-button>
<el-dialog :visible.sync="dialogFormVisible">
      <RText  v-if="dialogFormVisible" :message="this.showmdata[this.num]"></RText>
</el-dialog>

  </div>

</template>

<script>
import * as echarts from 'echarts';
import {test4} from "@/api/test";
import RXtext from '@/views/xianshi/compents/RText'
import RText from "@/views/xianshi/compents/RText";
export default {
  name:"testss",
  components: {RText},
  data() {
    return {
      option: {
        xAxis: {
          data: [],
          axisLabel:{
            interval:0
          }
        },
        itemStyle: {
          barBorderRadius: [2, 2, 0, 0], //柱体圆角
          color: new echarts.graphic.LinearGradient(
            //前四个参数用于配置渐变色的起止位置，这四个参数依次对应 右下左上 四个方位。也就是从右边开始顺时针方向。
            //通过修改前4个参数，可以实现不同的渐变方向
            /*第五个参数则是一个数组，用于配置颜色的渐变过程。
              每项为一个对象，包含offset和color两个参数
            */
            0, 0, 0, 1, [{//代表渐变色从正上方开始
              offset: 0, //offset范围是0~1，用于表示位置，0是指0%处的颜色
              color: '#005BEA'
            }, //柱图渐变色
              {
                offset: 1, //指100%处的颜色
                color: '#00C6FB'
              }
            ]
          ),
        },
        yAxis: {},
        dataGroupId: '',
        animationDurationUpdate: 500,
        series: {
          type: 'bar',
          id: 'sales',
          data: [
          ],
          universalTransition: {
            enabled: true,
            divideShape: 'clone'
          }
        }
      },
      drilldownData: [
      ],
      dialogFormVisible:false,
      showmdata: [{
        "college": "北京师范大学",
        "training_objs": [],
        "job_exp_objs": [
          {
            "end_date": "至今",
            "job_pos_type_p": "其他",
            "job_content": "质管部部长助理.负责票证车间生产质量检查,控制,兼任企业内审员,推行ISO9001:2008及ISO14000体系并年审。",
            "job_position": "部长助理",
            "job_duration": "1年3个月",
            "job_cpy": "北京猫眼机械有限公司",
            "start_date": "2022.03"
          },
          {
            "end_date": "2022.03",
            "job_pos_type_p": "总裁助理/总经理助理",
            "job_content": "根据公司的经营理念和发展战略制定公司各工作岗位的工作目标;负责制定及推进公司员工的培训、绩效、薪酬的管理。",
            "job_position": "总经理助理",
            "job_duration": "1年1个月",
            "job_cpy": "北京猫眼国际货运代理有限公司",
            "start_date": "2021.02"
          },
          {
            "end_date": "2021.02",
            "job_pos_type_p": "其他",
            "job_content": "根据目标管理综合考评内容,深入、细致地到所跟踪的各场所了解、掌握情况,帮助和促进各场所提高行政、后勤管理水平。",
            "job_position": "运营助理",
            "job_duration": "1年",
            "job_cpy": "北京猫眼文化传媒有限公司",
            "start_date": "2020.02"
          }
        ],
        "work_company": "北京猫眼机械有限公司",
        "cont_expect_job": "行政管理类",
        "major": "国际经济与贸易",
        "college_type": "1",
        "hukou_address_norm": "中国-北京-北京市-海淀区",
        "resume_name": "cv20230613_233844657_970.docx",
        "work_start_time_inf": "2020.02",
        "height": "178cm",
        "cert_objs": [
          {
            "langcert_lang": "英语",
            "langcert_name": "大学英语6级"
          }
        ],
        "work_start_time": "2020.02",
        "degree": "本科",
        "weight": "50kg",
        "work_year": "3.4",
        "cont_education": "2015-2019 国际经济与贸易\n北京师范大学\n政治经济学、西方经济学、国际经济学、计量经济学、世界经济概论、国际贸易理论与实务、国际金融、国际结算。",
        "college_rank": "16",
        "work_pos_type_p": "其他",
        "expect_job": "行政管理",
        "resume_integrity": "57",
        "phone": "138 9999 9999",
        "cont_hobby": "本人性格开朗、稳重、有活力,待人热情、真诚。有较强的组织能力、团体协作精神,较好的社交能力,善于处理各种人际关系。能迅速的适应各种环境,并融合其中。能把企业当作家庭,企业的财富就是我的财富,在努力为企业服务的过程中实现自身价值。\nzhangjiwei@163.com\n138 9999 9999",
        "name": "张吉惟",
        "grad_time": "2019",
        "birthday": "1998.11",
        "resume_parse_time": "2023-06-13 23:38:44",
        "cont_job_exp": "2022.3至今 部长助理\n北京猫眼机械有限公司\n质管部部长助理.负责票证车间生产质量检查,控制,兼任企业内审员,推行ISO9001:2008及ISO14000体系并年审。\n2021.2-2022.3 总经理助理\n北京猫眼国际货运代理有限公司\n根据公司的经营理念和发展战略制定公司各工作岗位的工作目标;负责制定及推进公司员工的培训、绩效、薪酬的管理。\n2020.2-2021.2 运营助理\n北京猫眼文化传媒有限公司\n根据目标管理综合考评内容,深入、细致地到所跟踪的各场所了解、掌握情况,帮助和促进各场所提高行政、后勤管理水平。",
        "gender": "女",
        "resume_type": "0",
        "hometown_address": "北京海淀区",
        "social_exp_objs": [],
        "proj_exp_objs": [],
        "surname": "张",
        "work_year_inf": "3.4",
        "lang_objs": [
          {
            "language_name": "英语"
          }
        ],
        "email": "zhangjiwei@163.com",
        "hukou_address": "北京海淀区",
        "raw_text": "张吉惟\nEXCEL\nPPT\nWORD\nAI\nPS\n个人技能\n出生年月:1998.11\n性    别:女\n籍    贯:北京海淀区\n学    历:本科\n政治面貌:党员\n身    高:178cm\n体    重:50kg\n工作经历\n自我评价\n个人爱好\n本人性格开朗、稳重、有活力,待人热情、真诚。有较强的组织能力、团体协作精神,较好的社交能力,善于处理各种人际关系。能迅速的适应各种环境,并融合其中。能把企业当作家庭,企业的财富就是我的财富,在努力为企业服务的过程中实现自身价值。\nzhangjiwei@163.com\n138 9999 9999\n求职意向:行政管理类\n基本信息\n2016 全国大学生英语竞赛一等奖\n2017 国家级一等奖学金\n2018 大学英语6级证书(CET-6)\n奖励证书\n教育背景\n2015-2019 国际经济与贸易\n北京师范大学\n政治经济学、西方经济学、国际经济学、计量经济学、世界经济概论、国际贸易理论与实务、国际金融、国际结算。\n2022.3至今 部长助理\n北京猫眼机械有限公司\n质管部部长助理.负责票证车间生产质量检查,控制,兼任企业内审员,推行ISO9001:2008及ISO14000体系并年审。\n2021.2-2022.3 总经理助理\n北京猫眼国际货运代理有限公司\n根据公司的经营理念和发展战略制定公司各工作岗位的工作目标;负责制定及推进公司员工的培训、绩效、薪酬的管理。\n2020.2-2021.2 运营助理\n北京猫眼文化传媒有限公司\n根据目标管理综合考评内容,深入、细致地到所跟踪的各场所了解、掌握情况,帮助和促进各场所提高行政、后勤管理水平。",
        "languages": "英语",
        "cont_basic_info": "张吉惟\nEXCEL\nPPT\nWORD\nAI\nPS\n出生年月:1998.11\n性    别:女\n籍    贯:北京海淀区\n学    历:本科\n政治面貌:党员\n身    高:178cm\n体    重:50kg\n2016 全国大学生英语竞赛一等奖\n2017 国家级一等奖学金\n2018 大学英语6级证书(CET-6)",
        "work_position": "部长助理",
        "education_objs": [
          {
            "end_date": "2019",
            "edu_college_type": "1",
            "edu_college": "北京师范大学",
            "edu_content": "政治经济学、西方经济学、国际经济学、计量经济学、世界经济概论、国际贸易理论与实务、国际金融、国际结算。",
            "edu_major": "国际经济与贸易",
            "edu_college_rank": "16",
            "start_date": "2015"
          }
        ],
        "polit_status": "党员",
        "work_year_norm": "3.4",
        "english_level": "大学英语6级",
        "all_cert_objs": [
          {
            "cert_name": "大学英语6级"
          }
        ],
        "skills_objs": [],
        "hometown_address_norm": "中国-北京-北京市-海淀区",
        "age": "25"
      }, {
        "college": "中央戏曲学院",
        "cont_award": "电视编导专业,擅长写作,摄影,视频制作。\n· 2年的新闻编辑实践经验,发表超过200余篇新闻文章。\n· 学习能力强,专业成绩突出,多次获得奖学金。",
        "resume_parse_time": "2023-05-10 20:03:02",
        "cont_job_exp": "2021.09~2022.06     百度   编辑\n在百度实习期间,在百度新闻网站发表新闻总计300余篇。\n2019.09~2022.09      校园网     记者\n在校期间,担任校园网记者,报道发表近100篇校内校外新闻。",
        "gender": "女",
        "training_objs": [],
        "resume_type": "0",
        "cont_job_skill": "优秀一等奖学金三次,二等奖学金两次,三等奖学金一次\n· 全国计算机二级证书\n· 普通话二级甲等证书\n· 2023年度荣获\"优秀团员\"称号\n· 2021~2022年度荣获\"创新创业\"奖",
        "job_exp_objs": [
          {
            "end_date": "2022.09",
            "job_pos_type_p": "记者",
            "job_content": "在校期间,担任校园网记者,报道发表近100篇校内校外新闻。",
            "job_position": "记者",
            "job_duration": "3年",
            "job_cpy": "校园网",
            "start_date": "2019.09"
          },
          {
            "end_date": "2022.06",
            "job_pos_type_p": "编辑",
            "job_content": "在百度实习期间,在百度新闻网站发表新闻总计300余篇。",
            "job_position": "编辑",
            "job_duration": "9个月",
            "job_cpy": "百度",
            "start_date": "2021.09"
          }
        ],
        "social_exp_objs": [],
        "work_company": "校园网",
        "cont_expect_job": "求职意向:编辑\n潘孝东",
        "major": "广播电视编导",
        "computer_level": "计算机二级",
        "proj_exp_objs": [],
        "surname": "潘",
        "work_year_inf": "1.8",
        "college_type": "0",
        "resume_name": "cv20230510_200302632_086.docx",
        "lang_objs": [],
        "work_start_time_inf": "2021.09",
        "email": "xiaohen@189.com",
        "cont_my_desc": "2019.12~2023.06   学生会团宣部   部长\n· 在担任团宣部部长期间,在校外新闻网站(四川新闻联播网,百姓生活网等)发表校内新闻70余篇,以及其它新闻总计200余篇。\n2021.09~2023.03      学生会               女生部副部长\n· 在担任女生部副部长期间,多次组织院内、校级素质拓展活动。\n2021.09~2022.06       学长导航员\n· 在担任学长导航学期间,解决学妹学弟生活上和学习上的各种问题。经常组织班级进行课外活动。",
        "raw_text": "Word  熟练\nExcel  熟悉\nPPT   熟悉\n基本信息\n女\n2001.12.18\n北京通州\n138 9999 9999\nxiaohen@189.com\n2021.09~2022.06     百度   编辑\n在百度实习期间,在百度新闻网站发表新闻总计300余篇。\n2019.09~2022.09      校园网     记者\n在校期间,担任校园网记者,报道发表近100篇校内校外新闻。\n求职意向:编辑\n潘孝东\n实习经历\n2019.09-2023.07    中央戏曲学院    广播电视编导   本科\n兴趣爱好\n个人技能\n· 优秀一等奖学金三次,二等奖学金两次,三等奖学金一次\n· 全国计算机二级证书\n· 普通话二级甲等证书\n· 2023年度荣获\"优秀团员\"称号\n· 2021~2022年度荣获\"创新创业\"奖\n荣誉证书\n· 电视编导专业,擅长写作,摄影,视频制作。\n· 2年的新闻编辑实践经验,发表超过200余篇新闻文章。\n· 学习能力强,专业成绩突出,多次获得奖学金。\n自我评价\n2019.12~2023.06   学生会团宣部   部长\n· 在担任团宣部部长期间,在校外新闻网站(四川新闻联播网,百姓生活网等)发表校内新闻70余篇,以及其它新闻总计200余篇。\n2021.09~2023.03      学生会               女生部副部长\n· 在担任女生部副部长期间,多次组织院内、校级素质拓展活动。\n2021.09~2022.06       学长导航员\n· 在担任学长导航学期间,解决学妹学弟生活上和学习上的各种问题。经常组织班级进行课外活动。\n教育背景\n校园经历",
        "cert_objs": [],
        "work_start_time": "2021.09",
        "cont_basic_info": "Word  熟练\nExcel  熟悉\nPPT   熟悉\n基本信息\n女\n2001.12.18\n北京通州\n138 9999 9999\nxiaohen@189.com",
        "work_position": "记者",
        "degree": "本科",
        "work_year": "1.8",
        "education_objs": [
          {
            "end_date": "2023.07",
            "edu_college_type": "0",
            "edu_college": "中央戏曲学院",
            "edu_degree": "本科",
            "edu_major": "广播电视编导",
            "edu_degree_norm": "本科",
            "start_date": "2019.09"
          }
        ],
        "cont_education": "2019.09-2023.07    中央戏曲学院    广播电视编导   本科",
        "work_year_norm": "1.8",
        "work_pos_type_p": "记者",
        "all_cert_objs": [
          {
            "cert_name": "全国计算机二级证书"
          },
          {
            "cert_name": "普通话二级甲等证书"
          }
        ],
        "expect_job": "编辑",
        "resume_integrity": "61",
        "skills_objs": [
          {
            "skills_name": "全国计算机二级"
          },
          {
            "skills_name": "普通话二级甲等"
          },
          {
            "skills_name": "编辑"
          }
        ],
        "phone": "13899999999",
        "name": "潘孝东",
        "grad_time": "2023.07"
      }, {
        "college": "陕西工业职业技术学院",
        "resume_parse_time": "2023-05-17 21:57:37",
        "cont_job_exp": "2021.7至今  诚森信息科技有限公司  营运推广主管\n· 负责社会化媒体营销团队的搭建工作,制定相关运营策略和指标,带领团队实施计划;\n· 网站常态运营活动规划和推进执行\n· 相关数据报告和统计,为公司决策层提供决策依据\n· 轻量级产品和应用的策划,统筹产品、技术团队成员实施。\n· 社会化媒体账号总共涨粉67万(包含QQ空间,人人网,新浪微博,腾讯微博)日均互动量相比接手前提升1000%,评论转发量级达到百千级\n2020.07-2021.07  康飞文化活动有限公司  市场专员实习\n· 网络推广渠道搭建维护,包括QQ空间、微博、豆瓣等;\n· 负责软硬广投放,网络舆情监控,公关稿撰写,事件营销策划;\n· 标书制作和撰写,甲方沟通工作。",
        "training_objs": [],
        "resume_type": "0",
        "cont_job_skill": "CET-6,优秀的听说写能力\n计算机二级,熟悉计算机各项操作\n高级营销员,国家职业资格四级",
        "cont_cover_letter": "您好!\n我是陕西工业职业技术学院的一名学生,即将面临毕业。四年来,在师友的严格 教益及个人的努力下,我具备了扎实的专业基础知识,系统地掌握了等有关理论;熟悉 涉外工作常用礼仪;具备较好的英语听、说、读、写、译等能力;能熟练操作计算机办公 软件。同时,我利用课余时间广泛地涉猎了大量书籍,不但充实了自己,也培养了自 己多方面的技能。\n此外,我还积极地参加各种社会活动,抓住每一个机会,锻炼自己。大学四年,我 深深地感受到,与优秀学生共事,使我在竞争中获益;向实际困难挑战,让我在挫折中 成长。我热爱贵单位所从事的事业,殷切地期望能够在您的领导下,为这一光荣的事业 添砖加瓦;并且在实践中不断学习、进步。随信附上个人求职简历,收笔之际,郑重地提 一个小小的要求:无论您是否选择我,尊敬的领导,希望您能够接受我诚恳的谢意!\n此致\n敬礼\n申请人:王彦霖\n申请时间: 2020年04月",
        "job_exp_objs": [
          {
            "end_date": "至今",
            "job_pos_type_p": "网站营运经理/主管",
            "job_content": "负责社会化媒体营销团队的搭建工作,制定相关运营策略和指标,带领团队实施计划;\n· 网站常态运营活动规划和推进执行\n· 相关数据报告和统计,为公司决策层提供决策依据\n· 轻量级产品和应用的策划,统筹产品、技术团队成员实施。\n· 社会化媒体账号总共涨粉67万(包含QQ空间,人人网,新浪微博,腾讯微博)日均互动量相比接手前提升1000%,评论转发量级达到百千级",
            "job_position": "营运推广主管",
            "job_duration": "1年10个月",
            "job_cpy": "诚森信息科技有限公司",
            "start_date": "2021.07"
          },
          {
            "end_date": "2021.07",
            "job_pos_type_p": "市场/营销/拓展专员",
            "job_nature": "实习",
            "job_content": "网络推广渠道搭建维护,包括QQ空间、微博、豆瓣等;\n· 负责软硬广投放,网络舆情监控,公关稿撰写,事件营销策划;\n· 标书制作和撰写,甲方沟通工作。",
            "job_position": "市场专员实习",
            "job_duration": "1年",
            "job_cpy": "康飞文化活动有限公司",
            "start_date": "2020.07"
          }
        ],
        "social_exp_objs": [],
        "work_company": "诚森信息科技有限公司",
        "major": "市场营销",
        "computer_level": "计算机二级",
        "proj_exp_objs": [],
        "surname": "王",
        "work_year_inf": "1.9",
        "college_type": "6",
        "resume_name": "cv20230517_215737660_815.docx",
        "lang_objs": [],
        "work_start_time_inf": "2021.07",
        "cont_my_desc": "本人是市场营销专业毕业生,有丰富的营销知识体系做基础;对于市场营销方面的前沿和动向有一定的了解,善于分析和吸取经验熟悉网络推广,尤其是社会化媒体方面,有独到的见解和经验个性开朗,容易相处,团队荣誉感强",
        "raw_text": "我,期待一个合适的位置\nesume\n求职简历\nR\n王彦霖\n1888888888\nNaisen.com\n市场专员\n王彦霖    26岁\n广东省广州市\n188888888\n求职目标:市场专员    Naisen.com\n教育背景\n2017.09-2020.07  陕西工业职业技术学院-市场营销  大专\n主修课程\n基本会计、统计学、市场营销、国际市场营销、市场调查与预测、商业心理学、广告学、公共关系学、货币银行学、经济法、国际贸易、大学英语、经济数学、计算机应用等。\n工作经验\n2021.7至今  诚森信息科技有限公司  营运推广主管\n· 负责社会化媒体营销团队的搭建工作,制定相关运营策略和指标,带领团队实施计划;\n· 网站常态运营活动规划和推进执行\n· 相关数据报告和统计,为公司决策层提供决策依据\n· 轻量级产品和应用的策划,统筹产品、技术团队成员实施。\n· 社会化媒体账号总共涨粉67万(包含QQ空间,人人网,新浪微博,腾讯微博)日均互动量相比接手前提升1000%,评论转发量级达到百千级\n2020.07-2021.07  康飞文化活动有限公司  市场专员实习\n· 网络推广渠道搭建维护,包括QQ空间、微博、豆瓣等;\n· 负责软硬广投放,网络舆情监控,公关稿撰写,事件营销策划;\n· 标书制作和撰写,甲方沟通工作。\n技能证书\nCET-6,优秀的听说写能力\n计算机二级,熟悉计算机各项操作\n高级营销员,国家职业资格四级\n自我评价\n本人是市场营销专业毕业生,有丰富的营销知识体系做基础;对于市场营销方面的前沿和动向有一定的了解,善于分析和吸取经验熟悉网络推广,尤其是社会化媒体方面,有独到的见解和经验个性开朗,容易相处,团队荣誉感强\n尊敬的领导:\n您好!\n我是陕西工业职业技术学院的一名学生,即将面临毕业。四年来,在师友的严格 教益及个人的努力下,我具备了扎实的专业基础知识,系统地掌握了等有关理论;熟悉 涉外工作常用礼仪;具备较好的英语听、说、读、写、译等能力;能熟练操作计算机办公 软件。同时,我利用课余时间广泛地涉猎了大量书籍,不但充实了自己,也培养了自 己多方面的技能。\n此外,我还积极地参加各种社会活动,抓住每一个机会,锻炼自己。大学四年,我 深深地感受到,与优秀学生共事,使我在竞争中获益;向实际困难挑战,让我在挫折中 成长。我热爱贵单位所从事的事业,殷切地期望能够在您的领导下,为这一光荣的事业 添砖加瓦;并且在实践中不断学习、进步。随信附上个人求职简历,收笔之际,郑重地提 一个小小的要求:无论您是否选择我,尊敬的领导,希望您能够接受我诚恳的谢意!\n此致\n敬礼\n申请人:王彦霖\n申请时间: 2020年04月",
        "cert_objs": [],
        "work_start_time": "2021.07",
        "cont_basic_info": "我,期待一个合适的位置\nesume\n求职简历\nR\n王彦霖\n1888888888\nNaisen.com\n市场专员\n王彦霖    26岁\n广东省广州市\n188888888\n求职目标:市场专员    Naisen.com",
        "work_position": "营运推广主管",
        "degree": "大专",
        "work_year": "1.9",
        "education_objs": [
          {
            "end_date": "2020.07",
            "edu_college_type": "6",
            "edu_college": "陕西工业职业技术学院",
            "edu_degree": "大专",
            "edu_content": "主修课程\n基本会计、统计学、市场营销、国际市场营销、市场调查与预测、商业心理学、广告学、公共关系学、货币银行学、经济法、国际贸易、大学英语、经济数学、计算机应用等。",
            "edu_major": "市场营销",
            "edu_degree_norm": "大专",
            "start_date": "2017.09"
          }
        ],
        "cont_education": "2017.09-2020.07  陕西工业职业技术学院-市场营销  大专\n主修课程\n基本会计、统计学、市场营销、国际市场营销、市场调查与预测、商业心理学、广告学、公共关系学、货币银行学、经济法、国际贸易、大学英语、经济数学、计算机应用等。",
        "work_year_norm": "1.9",
        "work_pos_type_p": "网站营运经理/主管",
        "all_cert_objs": [
          {
            "cert_name": "大学英语6级"
          },
          {
            "cert_name": "计算机二级"
          },
          {
            "cert_name": "高级营销员"
          }
        ],
        "expect_job": "市场专员",
        "resume_integrity": "51",
        "skills_objs": [
          {
            "skills_name": "CET-6"
          },
          {
            "skills_name": "计算机二级"
          },
          {
            "skills_name": "市场营销"
          },
          {
            "skills_name": "网络推广"
          },
          {
            "skills_name": "策划"
          },
          {
            "skills_name": "公关"
          },
          {
            "skills_name": "营销策划"
          }
        ],
        "name": "王彦霖",
        "grad_time": "2020.07",
        "age": "26"
      },{
      "college": "武汉理工大学",
        "cont_award": "普通话一级甲等\n通过全国计算机二级考试,熟练运用office相关软件。\n熟练使用绘声绘色软件,剪辑过各种类型的电影及班级视频。\n大学英语四/六级(CET-4/6),良好听说读写能力,快速浏览英语专业书籍。\n奖项荣誉\n2011年  新长城武汉理工大学自强社\u201c优秀社员\u201d\n2010年  三下乡\u201d社会实践活动\u201c优秀学生\u201d\n2009年  武汉理工大学学生田径运动会10人立定跳远团体赛第三名\n2008年  学生军事技能训练\u201c优秀学员\u201d\n2007年  武汉理工大学盼盼杯烘焙食品创意大赛优秀奖\n2006年  西部高校大学生主题征文一等奖\n2005年  武汉理工大学\u201c点燃川大梦  畅享我青春\u201d微博文征集大赛二等奖",
        "resume_parse_time": "2023-05-10 20:03:37",
        "cont_job_exp": "2015.12-至今                          迅维控股集团                     副总监\n· 负责协助集团旗下事业部开展各项工作,制定品牌传播方案;\n· 结合集团与事业部发展,制定营销策略、广告策略、品牌策略和公关策略,并组织推进执行;\n· 制定和执行媒体投放计划,跟踪和监督媒体投放效果,进行数据分析与撰写报告;\n· 研究行业发展动态,定期进行市场调查,为产品更新提供建议。\n2013.12-2015.12                      立翔有限公司                      市场及运营总监\n· 根据公司发展情况进行战略调整,配合前端销售部门搭建销售渠道;\n· 研究行业发展动态,定期进行市场调查,为产品更新提供建议;\n· 负责公司部门(营运、品牌策划)制度规范,负责组织及监管市场部关于对外合作、推广策划以相关工作的落实。\n2011.12-2013.12                       杉永俱乐部                        市场副总监\n· 负责事业部产品对外推广和宣传,制定各种整合营销的活动;\n· 执行媒体投放计划,跟踪和监督媒体投放效果,进行数据分析撰写报告;\n· 向市场总监提供营销支持,并协助相关的公关事宜。",
        "training_objs": [],
        "resume_type": "0",
        "job_exp_objs": [
        {
          "end_date": "至今",
          "job_pos_type_p": "公关总监",
          "job_content": "负责协助集团旗下事业部开展各项工作,制定品牌传播方案;\n· 结合集团与事业部发展,制定营销策略、广告策略、品牌策略和公关策略,并组织推进执行;\n· 制定和执行媒体投放计划,跟踪和监督媒体投放效果,进行数据分析与撰写报告;\n· 研究行业发展动态,定期进行市场调查,为产品更新提供建议。",
          "job_position": "副总监",
          "job_duration": "7年5个月",
          "job_cpy": "迅维控股集团",
          "start_date": "2015.12"
        },
        {
          "end_date": "2015.12",
          "job_pos_type_p": "市场/营销/拓展总监",
          "job_content": "根据公司发展情况进行战略调整,配合前端销售部门搭建销售渠道;\n· 研究行业发展动态,定期进行市场调查,为产品更新提供建议;\n· 负责公司部门(营运、品牌策划)制度规范,负责组织及监管市场部关于对外合作、推广策划以相关工作的落实。",
          "job_position": "市场及运营总监",
          "job_duration": "2年",
          "job_cpy": "立翔有限公司",
          "start_date": "2013.12"
        },
        {
          "end_date": "2013.12",
          "job_pos_type_p": "市场/营销/拓展总监",
          "job_dept": "俱乐部",
          "job_content": "负责事业部产品对外推广和宣传,制定各种整合营销的活动;\n· 执行媒体投放计划,跟踪和监督媒体投放效果,进行数据分析撰写报告;\n· 向市场总监提供营销支持,并协助相关的公关事宜。",
          "job_position": "市场副总监",
          "job_duration": "2年",
          "job_cpy": "杉永",
          "start_date": "2011.12"
        }
      ],
        "social_exp_objs": [],
        "work_company": "迅维控股集团",
        "major": "市场营销",
        "computer_level": "计算机二级",
        "proj_exp_objs": [
        {
          "proj_content": "杉永集团品牌升级发布会\n· 集团全新品牌logo及VI上线,在多渠道进行了传播;\n· 企业VIP客户群体逾60人,结合了线上发布、线下体验;\n· 后续媒体报道持续升温,子品牌结合明星代言人制造话题营销,为期3周。\n立翔商业模式发布会\n· 整场活动以会议+洽谈双重模式进行,首日以介绍立翔内部平台资源优势,一对多推介会进行推广普及;\n· 现场签署地方合作意向书,如:新疆、江西、浙江等优秀企业商户;\n· 以中国的波尔多为宣传点,主推旗下新疆大型项目,制造营销、品牌热点。\n迅维投资控股集团6A自媒体生态圈建设\n· 本项目重构了公司现有微信企业号的功能与架构。\n· 提高公众号的关注粉丝量的同时,对于有客户进行统一宣传,统一管理。",
          "proj_name": "杉永集团品牌升级发布会"
        }
      ],
        "surname": "吕",
        "work_year_inf": "11.5",
        "college_type": "2",
        "resume_name": "cv20230510_200337003_370.docx",
        "lang_objs": [],
        "work_start_time_inf": "2011.12",
        "email": "nesson@91muban.cn",
        "cont_my_desc": "拥有多年的市场管理及品牌营销经验,卓越的规划、组织、策划、方案执行和团队领导能力,积累较强的人际关系处理能力和商务谈判技巧,善于沟通,具备良好的合作关系掌控能力与市场开拓能力;\n敏感的商业和市场意识,具备优秀的资源整合能力、业务推进能力;\n思维敏捷,有培训演讲能力,懂激励艺术,能带动团队的积极性;擅长协调平衡团队成员的竞争与合作的关系,善于通过培训提高团队综合能力和凝聚力。",
        "raw_text": "1986.04.04\n+86 13800138000\nnesson@91muban.cn\n吕致盈\n求职目标:市场总监-专注品牌\n教育背景\n2008.07-2011.06                       武汉理工大学                      市场营销(硕士)\n主修课程:管理学、微观经济学、宏观经济学、管理信息系统、统计学、会计学、财务管理、市场营销、经济法、消费者行为学、国际市场营销。\n2004.07-2008.06                       武汉理工大学                     市场营销(本科)\n主修课程:管理学、微观经济学、宏观经济学、管理信息系统、统计学、会计学、财务管理、市场营销、经济法、消费者行为学、国际市场营销。\n工作经历\n2015.12-至今                          迅维控股集团                     副总监\n· 负责协助集团旗下事业部开展各项工作,制定品牌传播方案;\n· 结合集团与事业部发展,制定营销策略、广告策略、品牌策略和公关策略,并组织推进执行;\n· 制定和执行媒体投放计划,跟踪和监督媒体投放效果,进行数据分析与撰写报告;\n· 研究行业发展动态,定期进行市场调查,为产品更新提供建议。\n2013.12-2015.12                      立翔有限公司                      市场及运营总监\n· 根据公司发展情况进行战略调整,配合前端销售部门搭建销售渠道;\n· 研究行业发展动态,定期进行市场调查,为产品更新提供建议;\n· 负责公司部门(营运、品牌策划)制度规范,负责组织及监管市场部关于对外合作、推广策划以相关工作的落实。\n2011.12-2013.12                       杉永俱乐部                        市场副总监\n· 负责事业部产品对外推广和宣传,制定各种整合营销的活动;\n· 执行媒体投放计划,跟踪和监督媒体投放效果,进行数据分析撰写报告;\n· 向市场总监提供营销支持,并协助相关的公关事宜。\n校园实践\n2005.05-2008.06                       武汉理工大学                      辩论队(队长)\n· 负责50余人团队的日常训练、选拔及团队建设;\n· 作为负责人对接多项商业校园行活动,如《奔跑吧兄弟》大学站录制、《时代周末》校园行。\n2008.11-2010.06                       沟通与交流协会                      创始人/副会长\n· 协助湖北省沟通协会创立武汉理工大学分部,从零开始组建初期团队;\n· 策划协会会员制,选拔、培训协会导师,推出一系列沟通课程。\n项目经历\n杉永集团品牌升级发布会\n· 集团全新品牌logo及VI上线,在多渠道进行了传播;\n· 企业VIP客户群体逾60人,结合了线上发布、线下体验;\n· 后续媒体报道持续升温,子品牌结合明星代言人制造话题营销,为期3周。\n立翔商业模式发布会\n· 整场活动以会议+洽谈双重模式进行,首日以介绍立翔内部平台资源优势,一对多推介会进行推广普及;\n· 现场签署地方合作意向书,如:新疆、江西、浙江等优秀企业商户;\n· 以中国的波尔多为宣传点,主推旗下新疆大型项目,制造营销、品牌热点。\n迅维投资控股集团6A自媒体生态圈建设\n· 本项目重构了公司现有微信企业号的功能与架构。\n· 提高公众号的关注粉丝量的同时,对于有客户进行统一宣传,统一管理。\n兴趣爱好\n阅读 / 旅行 / 跑步 / 羽毛球 / 爬山 / 烹饪\n自我评价\n拥有多年的市场管理及品牌营销经验,卓越的规划、组织、策划、方案执行和团队领导能力,积累较强的人际关系处理能力和商务谈判技巧,善于沟通,具备良好的合作关系掌控能力与市场开拓能力;\n敏感的商业和市场意识,具备优秀的资源整合能力、业务推进能力;\n思维敏捷,有培训演讲能力,懂激励艺术,能带动团队的积极性;擅长协调平衡团队成员的竞争与合作的关系,善于通过培训提高团队综合能力和凝聚力。\n奖项荣誉\n普通话一级甲等\n通过全国计算机二级考试,熟练运用office相关软件。\n熟练使用绘声绘色软件,剪辑过各种类型的电影及班级视频。\n大学英语四/六级(CET-4/6),良好听说读写能力,快速浏览英语专业书籍。\n奖项荣誉\n2011年  新长城武汉理工大学自强社\u201c优秀社员\u201d\n2010年  三下乡\u201d社会实践活动\u201c优秀学生\u201d\n2009年  武汉理工大学学生田径运动会10人立定跳远团体赛第三名\n2008年  学生军事技能训练\u201c优秀学员\u201d\n2007年  武汉理工大学盼盼杯烘焙食品创意大赛优秀奖\n2006年  西部高校大学生主题征文一等奖\n2005年  武汉理工大学\u201c点燃川大梦  畅享我青春\u201d微博文征集大赛二等奖",
        "cert_objs": [],
        "work_start_time": "2011.12",
        "cont_basic_info": "1986.04.04\n+86 13800138000\nnesson@91muban.cn\n吕致盈\n求职目标:市场总监-专注品牌",
        "work_position": "副总监",
        "degree": "硕士",
        "work_year": "11.5",
        "education_objs": [
        {
          "end_date": "2011.06",
          "edu_college_type": "2",
          "edu_college": "武汉理工大学",
          "edu_degree": "硕士",
          "edu_content": "主修课程:管理学、微观经济学、宏观经济学、管理信息系统、统计学、会计学、财务管理、市场营销、经济法、消费者行为学、国际市场营销。",
          "edu_major": "市场营销",
          "edu_college_rank": "51",
          "edu_degree_norm": "硕士研究生",
          "start_date": "2008.07"
        },
        {
          "end_date": "2008.06",
          "edu_college_type": "2",
          "edu_college": "武汉理工大学",
          "edu_degree": "本科",
          "edu_content": "主修课程:管理学、微观经济学、宏观经济学、管理信息系统、统计学、会计学、财务管理、市场营销、经济法、消费者行为学、国际市场营销。",
          "edu_major": "市场营销",
          "edu_college_rank": "51",
          "edu_degree_norm": "本科",
          "start_date": "2004.07"
        }
      ],
        "cont_education": "2008.07-2011.06                       武汉理工大学                      市场营销(硕士)\n主修课程:管理学、微观经济学、宏观经济学、管理信息系统、统计学、会计学、财务管理、市场营销、经济法、消费者行为学、国际市场营销。\n2004.07-2008.06                       武汉理工大学                     市场营销(本科)\n主修课程:管理学、微观经济学、宏观经济学、管理信息系统、统计学、会计学、财务管理、市场营销、经济法、消费者行为学、国际市场营销。",
        "college_rank": "51",
        "work_year_norm": "11.5",
        "cont_campus_exp": "2005.05-2008.06                       武汉理工大学                      辩论队(队长)\n· 负责50余人团队的日常训练、选拔及团队建设;\n· 作为负责人对接多项商业校园行活动,如《奔跑吧兄弟》大学站录制、《时代周末》校园行。\n2008.11-2010.06                       沟通与交流协会                      创始人/副会长\n· 协助湖北省沟通协会创立武汉理工大学分部,从零开始组建初期团队;\n· 策划协会会员制,选拔、培训协会导师,推出一系列沟通课程。",
        "work_pos_type_p": "公关总监",
        "all_cert_objs": [
        {
          "cert_name": "普通话一级甲等"
        },
        {
          "cert_name": "全国计算机二级考试"
        },
        {
          "cert_name": "大学英语4级"
        },
        {
          "cert_name": "优秀社员"
        }
      ],
        "cont_proj_exp": "杉永集团品牌升级发布会\n· 集团全新品牌logo及VI上线,在多渠道进行了传播;\n· 企业VIP客户群体逾60人,结合了线上发布、线下体验;\n· 后续媒体报道持续升温,子品牌结合明星代言人制造话题营销,为期3周。\n立翔商业模式发布会\n· 整场活动以会议+洽谈双重模式进行,首日以介绍立翔内部平台资源优势,一对多推介会进行推广普及;\n· 现场签署地方合作意向书,如:新疆、江西、浙江等优秀企业商户;\n· 以中国的波尔多为宣传点,主推旗下新疆大型项目,制造营销、品牌热点。\n迅维投资控股集团6A自媒体生态圈建设\n· 本项目重构了公司现有微信企业号的功能与架构。\n· 提高公众号的关注粉丝量的同时,对于有客户进行统一宣传,统一管理。",
        "expect_job": "市场总监",
        "resume_integrity": "63",
        "skills_objs": [
        {
          "skills_name": "策划"
        },
        {
          "skills_name": "商务谈判"
        },
        {
          "skills_name": "演讲"
        },
        {
          "skills_name": "公关"
        },
        {
          "skills_name": "数据分析"
        },
        {
          "skills_name": "前端"
        },
        {
          "skills_name": "品牌策划"
        }
      ],
        "phone": "13800138000",
        "cont_hobby": "阅读 / 旅行 / 跑步 / 羽毛球 / 爬山 / 烹饪",
        "name": "吕致盈",
        "grad_time": "2011.06"
    }, {
        "college": "华南师范大学",
        "birthday": "1996.05",
        "cont_award": "普通话一级甲等\n通过全国计算机二级考试,熟练运用office相关软件。\n熟练使用绘声绘色软件,剪辑过各种类型的电影及班级视频。\n大学英语四/六级(CET-4/6),良好听说读写能力,快速浏览英语专业书籍。",
        "resume_parse_time": "2023-05-17 20:02:31",
        "cont_job_exp": "一、伊淼集团品牌升级发布会\n· 集团全新品牌logo及VI上线,在多渠道进行了传播;\n· 企业VIP客户群体逾60人,结合了线上发布、线下体验;\n· 后续媒体报道持续升温,子品牌罄玉结合代言人罗嘉良制造话题营销,为期3周;\n二、华泛科技商业模式发布会\n· 整场活动以会议+洽谈双重模式进行,首日以介绍华泛内部平台资源优势,政府背景优势等为主,一对多推介会进行推广普及;\n· 现场签署地方合作意向书,如:新疆、江西、浙江等优秀企业商户;\n· 以中国的波尔多为宣传点,主推旗下新疆大型项目,罄玉生态葡萄庄园、沙漠主题俱乐部等,制造营销、品牌热点。\n三、金恪投资控股集团6A自媒体生态圈建设\n· 本项目重构了公司现有微信企业号的功能与架构。\n· 提高公众号的关注粉丝量的同时,对于有客户进行统一宣传,统一管理。",
        "living_address_norm": "中国-广东省-广州市-海珠区",
        "city": "广州市",
        "training_objs": [],
        "resume_type": "0",
        "job_exp_objs": [],
        "social_exp_objs": [],
        "major": "广告策略",
        "computer_level": "计算机二级",
        "proj_exp_objs": [
          {
            "proj_content": "阅读          旅行          骑行          音乐          爬山",
            "proj_name": "旅行"
          }
        ],
        "surname": "林",
        "college_type": "2",
        "resume_name": "cv20230517_200230706_279.docx",
        "city_norm": "中国-广东省-广州市-海珠区",
        "lang_objs": [],
        "email": "linyanan@qq.com",
        "cont_my_desc": "2016年  新长城华南师范大学自强社\u201c优秀社员\u201d\n2015年  三下乡\u201d社会实践活动\u201c优秀学生\u201d\n2015年 华南师范大学学生田径运动会10人立定跳远团体赛第三名\n2015年  学生军事技能训练\u201c优秀学员\u201d\n2015年  华南师范大学盼盼杯烘焙食品创意大赛优秀奖\n2014年  华南高校大学生主题征文一等奖\n2014年  华南师范大学\u201c点燃中国梦  畅享我青春\u201d微博文征集大赛二等奖",
        "raw_text": "林雅南\n求职目标:市场总监-专注品牌方向\n出生:1996.05\n电话:13801138823\n民族:汉\n邮箱:linyanan@qq.com\n群面:中共党员\n住址:广东省广州市海珠区\n· 具备较强的团队管理和领导能力,优秀的组织策划能力,曾带领过超20人以上的团队,有大型市场推广活动的成功经验。\n· 丰富的客户资源和良好的渠道拓展与管理经验,丰富的市场营销策划和领导经验,善于发掘和培养人才,行业人才资源丰富。\n· 具备充沛的媒体资源、品牌圈层关系网络,能够带领团队高效、有效的完成公司的既定战略目标,以实现价值的最大化。\n· 熟悉各种推广媒体、精通各种推广渠道和手段,包括对它们的效果分析、ROI分析等,有活动营销、PR营销、BD等方面的实际操作经验。\n个人简介:\n2015.05-2016.06         华南师范大学         辩论队(队长)\n任职描述:\n· 负责50余人团队的日常训练、选拔及团队建设;\n· 作为负责人对接多项商业校园行活动,如《奔跑吧兄弟》大学站录制、长安福特全球校园行、《时代周末》校园行;\n· 代表华南师范大学辩论队参与多项国际型比赛,并取得多项荣誉:\n· 华南师范大学\u201c唇舌烽火\u201d辩论赛冠军、亚军;\n· 华南师范大学2016级\u201c杰出辩手\u201d;\n2016.11-2018.06         沟通与交流协会        创始人/副会长\n任职描述:\n· 协助湖北省沟通协会创立华南师范大学分部,从零开始组建初期团队;\n· 策划协会会员制,选拔、培训协会导师,推出一系列沟通课程;配合其他社团组织,承办诸如演讲、主持、讲坛等省级/校级活动;\n校园经历:\n2014.09-2018.06         华南师范大学         市场营销(本科)\n主修课程:管理学、微观经济学、宏观经济学、管理信息系统、统计学、会计学、财务管理、市场营销、经济法、消费者行为学、国际市场营销\n教育背景:\n2021.09-至今            金恪投资控股集团        副总监\n· 负责协助集团旗下事业部开展各项工作,制定品牌传播方案;\n· 结合集团与事业部发展,制定营销策略、广告策略、品牌策略和公关策略,并组织推进执行;\n· 制定和执行媒体投放计划,跟踪和监督媒体投放效果,进行数据分析与撰写报告;\n· 负责公司品牌形象和价值提升的持续优化,提高品牌知名度;\n· 研究行业发展动态,定期进行市场调查,为产品更新提供建议。\n2020.08-2021.09         华泛科技有限公司        市场及运营总监\n· 根据公司发展情况进行战略调整,配合前端销售部门搭建销售渠道;\n· 负责公司品牌形象和价值提升的持续优化,提高品牌知名度;\n· 研究行业发展动态,定期进行市场调查,为产品更新提供建议;\n· 负责公司部门(营运、品牌策划)制度规范,负责组织及监管市场部关于对外合作、渠道管理、媒体合作、推广策划以相关工作的落实。\n2019.12-2020.08         优酷俱乐部          市场副总监\n· 负责事业部产品对外推广和宣传,制定各种整合营销的活动;\n· 执行媒体投放计划,跟踪和监督媒体投放效果,进行数据分析撰写报告;\n· 向市场总监提供营销支持,并协助相关的公关事宜。\n2018.08-2019.12         伊淼集团            市场部-市场经理\n· 负责集团SEO优化事宜,在未使用百度竞价排名服务前提下,连接占据首页4至12条;\n· 参与策划集团年度、季度、月度线下推广活动方案;\n· 负责线下大型分享会\u201d思享潭\u201c的执行与后期线上推广。\n工作经历:\n一、伊淼集团品牌升级发布会\n· 集团全新品牌logo及VI上线,在多渠道进行了传播;\n· 企业VIP客户群体逾60人,结合了线上发布、线下体验;\n· 后续媒体报道持续升温,子品牌罄玉结合代言人罗嘉良制造话题营销,为期3周;\n二、华泛科技商业模式发布会\n· 整场活动以会议+洽谈双重模式进行,首日以介绍华泛内部平台资源优势,政府背景优势等为主,一对多推介会进行推广普及;\n· 现场签署地方合作意向书,如:新疆、江西、浙江等优秀企业商户;\n· 以中国的波尔多为宣传点,主推旗下新疆大型项目,罄玉生态葡萄庄园、沙漠主题俱乐部等,制造营销、品牌热点。\n三、金恪投资控股集团6A自媒体生态圈建设\n· 本项目重构了公司现有微信企业号的功能与架构。\n· 提高公众号的关注粉丝量的同时,对于有客户进行统一宣传,统一管理。\n项目经验:\n阅读          旅行          骑行          音乐          爬山\n兴趣爱好:\n· 确定产品线的市场定位,寻找目标人群喜欢的代言人;\n· 前中后期对代言人进行筛选、洽谈及各细节把控;\n· 签署合作协议,制定代言期限内规划及执行跟进(具体一般包含平面、TVC及商演)\n· 策划相关产品、人物的话题营销,以自媒体、新媒体为导向的二次推广;\n· 设计产品推出的营销计划,含周期、预算、规模等(金融产品涉及不定期的回报率等);\n· 任职期间,主导并签署了吕良伟2年合作协议,参与平面拍摄、加长版宣传片、TVC拍摄及后期广告投放;商演合作2次,并多次组织与吕良伟旗下触动传媒联合跨界活动。\n· 任职期间,主导了香港艺人罗嘉良的合作协议,参与平面拍摄加长版宣传片、TVC拍摄及后期广告投放;商演合作3次,后期会根据罗嘉良电影、电视剧档期调整安排植入营销。\n代言项目:\n· 拥有多年的市场管理及品牌营销经验,卓越的规划、组织、策划、方案执行和团队领导能力,积累较强的人际关系处理能力和商务谈判技巧,善于沟通,具备良好的合作关系掌控能力与市场开拓能力;\n· 敏感的商业和市场意识,具备优秀的资源整合能力、业务推进能力;\n· 思维敏捷,有培训演讲能力,懂激励艺术,能带动团队的积极性;\n· 擅长协调平衡团队成员的竞争与合作的关系,善于通过培训提高团队综合能力和凝聚力。\n自我评价:\n2016年  新长城华南师范大学自强社\u201c优秀社员\u201d\n2015年  三下乡\u201d社会实践活动\u201c优秀学生\u201d\n2015年 华南师范大学学生田径运动会10人立定跳远团体赛第三名\n2015年  学生军事技能训练\u201c优秀学员\u201d\n2015年  华南师范大学盼盼杯烘焙食品创意大赛优秀奖\n2014年  华南高校大学生主题征文一等奖\n2014年  华南师范大学\u201c点燃中国梦  畅享我青春\u201d微博文征集大赛二等奖\n奖项荣誉:\n普通话一级甲等\n通过全国计算机二级考试,熟练运用office相关软件。\n熟练使用绘声绘色软件,剪辑过各种类型的电影及班级视频。\n大学英语四/六级(CET-4/6),良好听说读写能力,快速浏览英语专业书籍。\n掌握技能:",
        "living_address": "广东省广州市海珠区",
        "cert_objs": [],
        "cont_course": "管理学、微观经济学、宏观经济学、管理信息系统、统计学、会计学、财务管理、市场营销、经济法、消费者行为学、国际市场营销",
        "race": "汉",
        "cont_basic_info": "林雅南\n求职目标:市场总监-专注品牌方向\n出生:1996.05\n电话:13801138823\n民族:汉\n邮箱:linyanan@qq.com\n群面:中共党员\n住址:广东省广州市海珠区\n· 具备较强的团队管理和领导能力,优秀的组织策划能力,曾带领过超20人以上的团队,有大型市场推广活动的成功经验。\n· 丰富的客户资源和良好的渠道拓展与管理经验,丰富的市场营销策划和领导经验,善于发掘和培养人才,行业人才资源丰富。\n· 具备充沛的媒体资源、品牌圈层关系网络,能够带领团队高效、有效的完成公司的既定战略目标,以实现价值的最大化。\n· 熟悉各种推广媒体、精通各种推广渠道和手段,包括对它们的效果分析、ROI分析等,有活动营销、PR营销、BD等方面的实际操作经验。\n个人简介:\n2015.05-2016.06         华南师范大学         辩论队(队长)\n任职描述:\n· 负责50余人团队的日常训练、选拔及团队建设;\n· 作为负责人对接多项商业校园行活动,如《奔跑吧兄弟》大学站录制、长安福特全球校园行、《时代周末》校园行;\n· 代表华南师范大学辩论队参与多项国际型比赛,并取得多项荣誉:\n· 华南师范大学\u201c唇舌烽火\u201d辩论赛冠军、亚军;\n· 华南师范大学2016级\u201c杰出辩手\u201d;\n2016.11-2018.06         沟通与交流协会        创始人/副会长\n任职描述:\n· 协助湖北省沟通协会创立华南师范大学分部,从零开始组建初期团队;\n· 策划协会会员制,选拔、培训协会导师,推出一系列沟通课程;配合其他社团组织,承办诸如演讲、主持、讲坛等省级/校级活动;",
        "education_objs": [
          {
            "end_date": "至今",
            "edu_college": "华南师范大学",
            "edu_content": "金恪投资控股集团        副总监\n· 负责协助集团旗下事业部开展各项工作,制定品牌传播方案;\n· 制定和执行媒体投放计划,跟踪和监督媒体投放效果,进行数据分析与撰写报告;\n· 负责公司品牌形象和价值提升的持续优化,提高品牌知名度;\n· 研究行业发展动态,定期进行市场调查,为产品更新提供建议。",
            "edu_major": "广告策略",
            "start_date": "2021.09"
          }
        ],
        "polit_status": "中共党员",
        "cont_education": "2021.09-至今            金恪投资控股集团        副总监\n· 负责协助集团旗下事业部开展各项工作,制定品牌传播方案;\n· 结合集团与事业部发展,制定营销策略、广告策略、品牌策略和公关策略,并组织推进执行;\n· 制定和执行媒体投放计划,跟踪和监督媒体投放效果,进行数据分析与撰写报告;\n· 负责公司品牌形象和价值提升的持续优化,提高品牌知名度;\n· 研究行业发展动态,定期进行市场调查,为产品更新提供建议。\n2020.08-2021.09         华泛科技有限公司        市场及运营总监\n· 根据公司发展情况进行战略调整,配合前端销售部门搭建销售渠道;\n· 负责公司品牌形象和价值提升的持续优化,提高品牌知名度;\n· 研究行业发展动态,定期进行市场调查,为产品更新提供建议;\n· 负责公司部门(营运、品牌策划)制度规范,负责组织及监管市场部关于对外合作、渠道管理、媒体合作、推广策划以相关工作的落实。\n2019.12-2020.08         优酷俱乐部          市场副总监\n· 负责事业部产品对外推广和宣传,制定各种整合营销的活动;\n· 执行媒体投放计划,跟踪和监督媒体投放效果,进行数据分析撰写报告;\n· 向市场总监提供营销支持,并协助相关的公关事宜。\n2018.08-2019.12         伊淼集团            市场部-市场经理\n· 负责集团SEO优化事宜,在未使用百度竞价排名服务前提下,连接占据首页4至12条;\n· 参与策划集团年度、季度、月度线下推广活动方案;\n· 负责线下大型分享会\u201d思享潭\u201c的执行与后期线上推广。",
        "college_rank": "73",
        "cont_campus_exp": "2014.09-2018.06         华南师范大学         市场营销(本科)",
        "all_cert_objs": [
          {
            "cert_name": "普通话一级甲等"
          },
          {
            "cert_name": "全国计算机二级考试"
          },
          {
            "cert_name": "大学英语4级"
          },
          {
            "cert_name": "优秀社员"
          }
        ],
        "cont_proj_exp": "阅读          旅行          骑行          音乐          爬山",
        "expect_job": "市场总监",
        "resume_integrity": "40",
        "skills_objs": [
          {
            "skills_name": "音乐"
          }
        ],
        "phone": "13801138823",
        "cont_hobby": "确定产品线的市场定位,寻找目标人群喜欢的代言人;\n· 前中后期对代言人进行筛选、洽谈及各细节把控;\n· 签署合作协议,制定代言期限内规划及执行跟进(具体一般包含平面、TVC及商演)\n· 策划相关产品、人物的话题营销,以自媒体、新媒体为导向的二次推广;\n· 设计产品推出的营销计划,含周期、预算、规模等(金融产品涉及不定期的回报率等);\n· 任职期间,主导并签署了吕良伟2年合作协议,参与平面拍摄、加长版宣传片、TVC拍摄及后期广告投放;商演合作2次,并多次组织与吕良伟旗下触动传媒联合跨界活动。\n· 任职期间,主导了香港艺人罗嘉良的合作协议,参与平面拍摄加长版宣传片、TVC拍摄及后期广告投放;商演合作3次,后期会根据罗嘉良电影、电视剧档期调整安排植入营销。\n代言项目:\n· 拥有多年的市场管理及品牌营销经验,卓越的规划、组织、策划、方案执行和团队领导能力,积累较强的人际关系处理能力和商务谈判技巧,善于沟通,具备良好的合作关系掌控能力与市场开拓能力;\n· 敏感的商业和市场意识,具备优秀的资源整合能力、业务推进能力;\n· 思维敏捷,有培训演讲能力,懂激励艺术,能带动团队的积极性;\n· 擅长协调平衡团队成员的竞争与合作的关系,善于通过培训提高团队综合能力和凝聚力。",
        "name": "林雅南",
        "grad_time": "2016级",
        "age": "27"
      },],
      num:0
    };
  },
created() {

},

  mounted() {
    test4().then(res=>{
      for (var i=0;i<res.data.zhubiao.length;i++){
        this.option.xAxis.data.push(res.data.zhubiao[i].groupId)
        this.option.series.data.push(res.data.zhubiao[i])
      }
      for (var j=0;j<res.data.fubiao.length;j++){
        this.drilldownData.push(res.data.fubiao[j])
      }

      console.log(this.option.xAxis.data)
      console.log(this.option.series.data)

      const chart = echarts.init(this.$refs.chart123);
      chart.setOption(this.option);
      chart.resize()
      chart.on('click', event => {
        if (event.data) {
          const subData = this.drilldownData.find(data => {
            return data.dataGroupId === event.data.groupId;
          });
          if (!subData) {
            return;
          }
          chart.setOption({
            xAxis: {
              data: subData.data.map(item => {
                return item[0];
              })
            },
            series: {
              type: 'bar',
              id: 'sales',
              dataGroupId: subData.dataGroupId,
              data: subData.data.map(item => {
                return item[1];
              }),
              universalTransition: {
                enabled: true,
                divideShape: 'clone'
              }
            },
            graphic: [
              {
                type: 'text',
                left: 50,
                top: 20,
                style: {
                  text: '返回',
                  fontSize: 18
                },
                onclick: () => {
                  chart.setOption(this.option);
                }
              }
            ]
          });
        }
      });
      chart.on('dblclick',event=>{

        this.dbclick(event.name);
      })

    })

  },

  methods:{
    pre(){
      console.log(this.drilldownData)
    },
    dbclick(name){
      this.num=Math.ceil(Math.random()*5)-1;
      this.showmdata[this.num].name=name
      this.dialogFormVisible=true
    }
  }

};
</script>
